In [ ]:
import json
import kagglehub
import numpy as np
import os
import pandas as pd
import requests
import shutil

In [3]:
path = kagglehub.dataset_download("retailrocket/ecommerce-dataset")
path

Downloading from https://www.kaggle.com/api/v1/datasets/download/retailrocket/ecommerce-dataset?dataset_version_number=2...

100%|██████████| 291M/291M [00:05<00:00, 58.3MB/s]

Extracting files...

'C:\\Users\\alinneman3\\.cache\\kagglehub\\datasets\\retailrocket\\ecommerce-dataset\\versions\\2'

In [6]:
downloaded_files = os.listdir(path)
downloaded_files

['category_tree.csv',
 'events.csv',
 'item_properties_part1.csv',
 'item_properties_part2.csv']

In [19]:
# Load in the data

category_df = pd.read_csv(os.path.join(path, downloaded_files[0]))
category_df['categoryid'] = category_df['categoryid'].astype('Int32')
category_df['parentid'] = category_df['parentid'].astype('Int32')
print(category_df.shape)
display(category_df.sample(5))

event_df = pd.read_csv(os.path.join(path, downloaded_files[1]))
print(event_df.shape)
display(event_df.sample(5))

item_df = pd.concat(
    [
        pd.read_csv(os.path.join(path, downloaded_files[2])),
        pd.read_csv(os.path.join(path, downloaded_files[3]))
    ],
    ignore_index=True
)
print(item_df.shape)
display(item_df.sample(5))

(1669, 2)

      categoryid  parentid
1660         112       381
260         1265      1136
297           56      1497
896         1400       335
575          220       795

(2756101, 5)

            timestamp  visitorid event  itemid  transactionid
977312  1440185094467    1197480  view  448792            NaN
771662  1439243897011     346597  view  267596            NaN
6916    1433171592286     184078  view   38073            NaN
399495  1434848366042     962631  view  416979            NaN
938410  1440019787382    1308603  view   45375            NaN

(20275902, 4)

,timestamp,itemid,property,value
646824,1434250800000,453611,1090,769062
3184379,1433646000000,87166,202,n23604.000 1019860 1071763 300440
1531875,1433646000000,124464,222,n12.000
17693233,1431226800000,328005,364,887058
18989740,1440298800000,383096,810,n3948.000 1144008 628176 n120.000 924073

In [ ]:
display(event_df['visitorid'].value_counts())
display(event_df['event'].value_counts())
display(event_df['itemid'].value_counts())

visitorid
1150086    7757
530559     4328
152963     3024
895999     2474
163561     2410
           ...
877104        1
1015187       1
1214670       1
648716        1
301110        1
Name: count, Length: 1407580, dtype: int64

event
view           2664312
addtocart        69332
transaction      22457
Name: count, dtype: int64

itemid
187946    3412
461686    2978
5411      2334
370653    1854
219512    1800
          ...
103980       1
316294       1
408646       1
206987       1
230235       1
Name: count, Length: 235061, dtype: int64

In [23]:
display(item_df['itemid'].value_counts())
display(item_df['property'].value_counts())

itemid
158903    468
254069    462
91855     461
150800    459
120386    444
         ...
251894     15
342400     14
73456      13
207227     12
243157     12
Name: count, Length: 417053, dtype: int64

property
888           3000398
790           1790516
available     1503639
categoryid     788214
6              631471
               ...
782                 1
288                 1
769                 1
312                 1
1046                1
Name: count, Length: 1104, dtype: int64

In [ ]:
item_df[item_df['']]

In [25]:
category_df[category_df['parentid'].isnull()]

      categoryid  parentid
5            231      <NA>
589          791      <NA>
861         1490      <NA>
939          431      <NA>
1111         755      <NA>
1142         378      <NA>
1208        1579      <NA>
1211        1394      <NA>
1322         659      <NA>
1329        1057      <NA>
1375         859      <NA>
1392         803      <NA>
1395         250      <NA>
1476        1452      <NA>
1484        1182      <NA>
1490        1692      <NA>
1614        1600      <NA>
1616        1482      <NA>
1622        1224      <NA>
1623        1532      <NA>
1624         395      <NA>
1628         653      <NA>
1629         140      <NA>
1650        1698      <NA>
1657         679      <NA>

In [26]:
category_df[~category_df['categoryid'].isin(category_df['parentid'])]

      categoryid  parentid
0           1016       213
1            809       169
2            570         9
4            536      1691
5            231      <NA>
...          ...       ...
1664          49      1125
1665        1112       630
1666        1336       745
1667         689       207
1668         761       395

[1307 rows x 2 columns]

In [28]:
category_df[category_df['categoryid'] == 1016]

   categoryid  parentid
0        1016       213